@echo off
chcp 65001 > nul
title سيرفر موقع جاوبني (Jawebni)
cls
echo.
echo ===================================================================
echo                  🚀 جاري تشغيل سيرفر موقع جاوبني
echo ===================================================================
echo.
echo  📍 افتح الموقع في حاسوبك عبر الرابط:
echo     http://localhost:8000
echo.
echo  📱 أرسل هذا الرابط لأصدقائك المتصلين معك على نفس الـ Wi-Fi:
echo     http://192.168.0.104:8000
echo.
echo ===================================================================
echo  (اترك هذه النافذة مفتوحة طالما أردت للموقع أن يعمل)
echo ===================================================================
echo.

cd /d "%~dp0"
py server.py
pause
